_posts/2016-06-23-openssl.html
---
title: "OpenSSL"
date: 2016-06-26
layout: post
categories: 
- 服务器
tags: 
- Linux 
- 安全
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 加密算法和协议</a></li>
<li><a href="#orgheadline2">2. SSL与TLS</a></li>
<li><a href="#orgheadline9">3. OpenSSL</a>
<ul>
<li><a href="#orgheadline3">组件</a></li>
<li><a href="#orgheadline4">openssl命令</a></li>
<li><a href="#orgheadline8">私有CA</a>
<ul>
<li><a href="#orgheadline5">PKI</a></li>
<li><a href="#orgheadline6">证书的申请和签署过程</a></li>
<li><a href="#orgheadline7">创建私有CA</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 加密算法和协议</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>对称加密</dt><dd>加密和解密使用同一个密钥
<ul class="org-ul">
<li>常见算法: <code>DES</code>, <code>3DES</code>, <code>AES</code>, <code>blowfish</code></li>
<li>特性: 将原始数据分割成固定大小的块，逐个进行加密</li>
<li>缺陷: 密钥过多，密钥需要共享</li>
</ul></dd>
<dt>公钥加密(非对称加密)</dt><dd><ul class="org-ul">
<li>公钥( <code>pubkey</code> ): 公开给所有人</li>
<li>私钥( <code>secret key</code>): 自己留存，必须保证其私密性</li>
<li>特点: 用公钥加密的数据，只能使用与之配对的私钥解密，反之亦然</li>
<li>功能
<ul class="org-ul">
<li><code>数字签名</code>: 主要在于让接收方确认发送方身份，因为私钥只有发送方有</li>
<li><code>密钥交换</code>: 发送方用对方的公钥加密一个对称密钥，并发送给对方</li>
<li><code>数据加密</code></li>
</ul></li>
<li><p>
常见算法: <code>RSA</code>, <code>DSA</code>, <code>ELGamal</code>
</p>
<pre class="example">
DSA仅用于数字签名的功能
</pre></li>
</ul>
<pre class="example">
DH算法: 用于解决公钥交换的安全性
1. A知道数字p,g,x，B知道数字p,g,y，即p,g是公开的
2. A发送p^x%g给B，B发送p^y%g给A，之后两人使用的密钥就是p^xy%g
</pre></dd>
<dt>单向加密</dt><dd>只能加密，不能解密，用于提取数据指纹
<ul class="org-ul">
<li>特性: 定长输出，雪崩效应</li>
<li>常见算法: <code>md5</code>, <code>sha1</code>, <code>sha224</code>, <code>sha256</code>, <code>sha384</code>, <code>sha512</code></li>
<li>功能: 保证数据完整性</li>
<li><code>MAC(Message Authentication Code)</code>: 单向加密的一种延伸应用，用于实现在网络通信中保证所传输的数据的完整性</li>
</ul></dd>
<dt>认证协议</dt><dd>使用用户名和密码进行认证</dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> SSL与TLS</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>SSL</code>: Secure Socket Layer</li>
<li><code>TLS</code>: Transport Layer Security，相当于SSL的升级版</li>
<li>特性: 在TCP/IP的应用层和传输层之间加了一层加密处理</li>
<li>该协议设计上也使用了分层设计</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">3</span> OpenSSL</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">组件</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li><code>openssl</code>: 多用途的命令行工具</li>
<li><code>libcrypto</code>: 公共加密解密库</li>
<li><code>libssl</code>: 实现了ssl和tls的库</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">openssl命令</h3>
<div class="outline-text-3" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-yaml">openssl COMMAND
  <span style="color: #FD971F;">version</span>: &#26597;&#35810;&#31243;&#24207;&#29256;&#26412;&#21495;
  <span style="color: #FD971F;">ca</span>: &#24314;&#31435;&#31169;&#26377;CA
</pre>
</div>
<dl class="org-dl">
<dt>对称加密</dt><dd><div class="org-src-container">

<pre class="src src-bash">openssl enc -e -des3 -a -in FILE_INPUT -out FILE_OUTPUT -pass pass:PASSWORD  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23545;&#31216;&#21152;&#23494;</span>
openssl enc -d -des3 -a -in FILE_INPUT -out FILE_OUTPUT -pass pass:PASSWORD  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23545;&#31216;&#35299;&#23494;</span>
</pre>
</div></dd>
<dt>单向加密</dt><dd><div class="org-src-container">

<pre class="src src-bash">openssl dgst -md5 /PATH/TO/SOMEFILE  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36827;&#34892;&#21333;&#21521;&#21152;&#23494;</span>
</pre>
</div></dd>
<dt>非对称加密</dt><dd><div class="org-src-container">

<pre class="src src-bash">openssl genrsa -out key.pri <span style="color: #AE81FF;">2048</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29983;&#25104;&#31169;&#38053;</span>
openssl rsa -in key.pri -pubout  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36890;&#36807;&#31169;&#38053;&#29983;&#25104;&#20844;&#38053;</span>
</pre>
</div></dd>
<dt>其他操作</dt><dd><div class="org-src-container">

<pre class="src src-bash">openssl passwd -1 -salt &#23494;&#30721;&#26434;&#36136;  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29983;&#25104;&#29992;&#25143;&#23494;&#30721;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-bash">openssl rand -<span style="color: #AE81FF;">{</span>hex|base64<span style="color: #AE81FF;">}</span> NUM  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29983;&#25104;NUM&#20010;&#23383;&#33410;&#30340;&#38543;&#26426;&#23383;&#31526;&#20018;</span>
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">私有CA</h3>
<div class="outline-text-3" id="text-orgheadline8">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">PKI</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
<code>PKI</code>: Public Key Infrastructure
</p>
<ul class="org-ul">
<li>签证机构: <code>CA</code> ，通过该机构来验证公钥的作者</li>
<li>注册机构: <code>RA</code></li>
<li>证书吊销列表: <code>CRL</code></li>
<li>证书存取库: 所有可信的CA公钥会放在所有用户电脑上</li>
<li>证书结构和认证协议标准: <code>X.509</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">证书的申请和签署过程</h4>
<div class="outline-text-4" id="text-orgheadline6">
<ol class="org-ol">
<li>生成申请请求</li>
<li>RA核验</li>
<li>CA签署</li>
<li>获取证书</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">创建私有CA</h4>
<div class="outline-text-4" id="text-orgheadline7">
<p>
openssl配置文件: <code>/etc/pki/tls/openssl.cnf</code>
</p>
<ol class="org-ol">
<li><p>
创建所需要的文件
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">cd</span> /etc/pki/CA
touch index.txt  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23384;&#20648;&#25152;&#26377;&#35777;&#20070;&#30340;&#32034;&#24341;&#20449;&#24687;</span>
<span style="color: #F92672;">echo</span> <span style="color: #AE81FF;">01</span> &gt; serial  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35777;&#20070;&#30340;&#32534;&#21495;</span>
</pre>
</div></li>
<li><p>
CA自签证书
</p>
<div class="org-src-container">

<pre class="src src-yaml">(umask 077; openssl genrsa -out /etc/pki/CA/private/cakey.pem 2048)  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23458;&#25143;&#31471;&#38656;&#35201;&#20351;&#29992;&#35813;&#31169;&#38053;&#25152;&#23545;&#24212;&#30340;&#20844;&#38053;</span>
openssl req -new -x509 -key /etc/pki/CA/private/cakey.epm -days 7300 -out /etc/pki/CA/cacert.pem
  <span style="color: #FD971F;">-new</span>: &#29983;&#25104;&#26032;&#35777;&#20070;&#31614;&#32626;&#35831;&#27714;
  <span style="color: #FD971F;">-x509</span>: &#19987;&#29992;&#20110;CA&#29983;&#25104;&#33258;&#31614;&#35777;&#20070;
  <span style="color: #FD971F;">-key</span>: &#29983;&#25104;&#35831;&#27714;&#26102;&#29992;&#21040;&#30340;&#31169;&#38053;&#25991;&#20214;
  <span style="color: #FD971F;">-days n</span>: &#35777;&#20070;&#30340;&#26377;&#25928;&#26399;&#38480;
  <span style="color: #FD971F;">-out /PATH/TO/SOMECERTFILE</span>: &#35777;&#20070;&#30340;&#20445;&#23384;&#36335;&#24452;
</pre>
</div></li>
<li>发证
<ol class="org-ol">
<li><p>
用到证书的主机生成证书请求
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">umask</span> <span style="color: #AE81FF;">077</span>; openssl genrsa -out /etc/httpd/ssl/httpd.key <span style="color: #AE81FF;">2048</span><span style="color: #AE81FF;">)</span>
openssl req -new -key /etc/httpd/ssl/httpd.key -days <span style="color: #AE81FF;">365</span> -out /etc/httpd/ssl/httpd.csr
</pre>
</div></li>
<li>把请求文件传输给CA</li>
<li><p>
CA签署证书，并将证书发还给请求者
</p>
<div class="org-src-container">

<pre class="src src-bash">openssl ca -in /tmp/httpd.csr -out /etc/pki/CA/certs/httpd.crt -days <span style="color: #AE81FF;">365</span>
openssl x509 -in /PATH/FROM/CERT_FILE -noout -text|-subject|-serial  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#30475;&#35777;&#20070;&#20013;&#30340;&#20449;&#24687;</span>
</pre>
</div></li>
</ol></li>
<li>吊销证书
<ol class="org-ol">
<li><p>
客户端获取要吊销的证书的serial
</p>
<div class="org-src-container">

<pre class="src src-bash">openssl x509 -in /PATH/FROM/CERT_FILE -noout -serial -subject
</pre>
</div></li>
<li>CA
<ol class="org-ol">
<li>对比客户提交的serial与subject信息是否与index.txt的信息一致</li>
<li><p>
吊销证书
</p>
<div class="org-src-container">

<pre class="src src-bash">openssl ca -revoke /etc/pki/CA/newcerts/SERIAL.pem
</pre>
</div></li>
<li><p>
生成吊销证书编号
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #F92672;">echo</span> <span style="color: #AE81FF;">01</span> &gt; /etc/pki/CA/crlnumber
</pre>
</div></li>
<li><p>
更新证书吊销列表
</p>
<div class="org-src-container">

<pre class="src src-bash">openssl ca -gencrl -out thisca.crl
openssl crl -in /PATH/FROM/CRL_FILE.crl -noout -text  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#30475;crl&#25991;&#20214;</span>
</pre>
</div></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
